# Контрольная работа

## План

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

## Задача
*Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

## Решение:

>Запрашиваем ввести длину массива у пользователя с клавиатуры  с помощью метода СоnsoleReadLine() и вспомогптельного сообщения выведенного с помощью Console.WriteLine().

>В первом цикле For пользователь заполняет массив Array значениями. И мы в этом же циклe считаем с помощью счетчика Count количество ячеек, в которых хранятся значения менее 4х символов, чтобы узнать длинну нового массива.

>Во втором цикле начинаем заполнять новый массив Array1 нужными значениями. Сначала проверяем: значение первой ячейки первого массива длинной менее 4 символов? если да, то записываем его в новый массив и переходим к следующим ячейкам обоих массивов, если нет, то переходим к следующей ячейке первого массива и сравниваем значение.

>В третьем цикле распечатываем новый получившийся массив, который соответствует условиям задачи.


## Readme.md

*Cоздан и отредактирован в соответствии с синтаксисом языка Мarkdown.*

## Блок-схема

+ Добавлена под названием контрольная с расширением .drawio 


